In [125]:
import numpy as np
import pandas as pd

In [126]:
dict1 = {
    "name":['harry','akash','rishi','kamlesh'],
    "marks":[92, 54, 56, 76],
    "city":['rampur','kolkata','jalandher','patna']
}

## 1. To make a new Dataframe

In [127]:
df = pd.DataFrame(dict1)
df

      name  marks       city
0    harry     92     rampur
1    akash     54    kolkata
2    rishi     56  jalandher
3  kamlesh     76      patna

## 2. To export dataframe in a csv file

In [128]:
df.to_csv('D:\Akash\Machine Learning\Data_for_ML\ friends.csv',index=False) # to delete unwanted index no. in our excel file

## 3. To import datasets

In [129]:
harry = pd.read_csv('D:\Akash\Machine Learning\Data_for_ML\Book1.csv' , parse_dates=["EST"])
# harry

## 4. some common opertions on dataframe

In [130]:
harry.head(3)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38,23,52,30.03,10,8.0,0.0,5,NaN,281
1,2016-01-02,36,18,46,30.02,10,7.0,0.0,3,NaN,275
2,2016-01-03,40,21,47,29.86,10,8.0,0.0,1,NaN,277

In [131]:
harry.tail(3)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
28,2016-01-29,36,21,50,29.58,10,8.0,0.0,4,NaN,298
29,2016-01-30,34,16,46,30.01,10,7.0,0.0,0,NaN,257
30,2016-01-31,46,28,52,29.90,10,5.0,0.0,0,NaN,241

In [132]:
harry.describe() # very usefull tool

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,24.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,0.183750,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,0.583317,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,0.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,0.000000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,0.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,2.310000,8.000000,345.000000

In [133]:
harry.dtypes

EST                     datetime64[ns]
Temperature                      int64
DewPoint                         int64
Humidity                         int64
Sea Level PressureIn           float64
VisibilityMiles                  int64
WindSpeedMPH                   float64
PrecipitationIn                float64
CloudCover                       int64
Events                          object
WindDirDegrees                   int64
dtype: object

In [134]:
harry['Humidity'][0] = 54  # to change datavalue or  harry[3][0] = 54
harry.head(3)

<ipython-input-134-eda6d5e5481e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Humidity'][0] = 54  # to change datavalue or  harry[3][0] = 54

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38,23,54,30.03,10,8.0,0.0,5,NaN,281
1,2016-01-02,36,18,46,30.02,10,7.0,0.0,3,NaN,275
2,2016-01-03,40,21,47,29.86,10,8.0,0.0,1,NaN,277

## To suffle a dataframe from row

In [135]:
df = df.sample(frac=1)
df

      name  marks       city
0    harry     92     rampur
1    akash     54    kolkata
2    rishi     56  jalandher
3  kamlesh     76      patna

# 5. Two typs of DataStructure in Pandas
## -> Series  
## -> DataFrame

### Series

In [136]:
ser = pd.Series(np.random.rand(34))
# ser

In [137]:
type(ser)

pandas.core.series.Series

### Dataframe

In [138]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))
type(newdf)

pandas.core.frame.DataFrame

In [139]:
newdf.head()

          0         1         2         3         4
0  0.661356  0.790988  0.816955  0.515202  0.348768
1  0.369261  0.344447  0.594809  0.454023  0.055929
2  0.173050  0.759926  0.340533  0.212910  0.415925
3  0.032329  0.200028  0.146421  0.705052  0.083880
4  0.464154  0.677997  0.172498  0.127146  0.800099

In [140]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [141]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

# 6. More Operations on datasets

In [142]:
newdf.to_numpy()  # to convert pandas dataframe into nympy array

array([[0.66135588, 0.79098814, 0.81695547, 0.51520225, 0.34876795],
       [0.36926104, 0.34444694, 0.59480881, 0.45402314, 0.05592909],
       [0.17304967, 0.75992589, 0.34053282, 0.21290977, 0.41592451],
       ...,
       [0.51222336, 0.83748778, 0.52170287, 0.64045172, 0.69305197],
       [0.81801019, 0.7408882 , 0.29419477, 0.0274681 , 0.48283493],
       [0.34100499, 0.67062897, 0.08164382, 0.4200348 , 0.84927652]])

In [143]:
newdf.T  # it transpose(interchange rows and columns)

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.661356,0.369261,0.173050,0.032329,0.464154,0.431176,0.305906,0.202698,0.710082,0.924411,...,0.672327,0.826414,0.572422,0.770924,0.984020,0.671657,0.675012,0.512223,0.818010,0.341005
1,0.790988,0.344447,0.759926,0.200028,0.677997,0.419692,0.149652,0.114420,0.834376,0.347278,...,0.853540,0.024424,0.021121,0.948467,0.132770,0.081046,0.924776,0.837488,0.740888,0.670629
2,0.816955,0.594809,0.340533,0.146421,0.172498,0.052647,0.230062,0.227797,0.388903,0.014833,...,0.240637,0.401416,0.824831,0.935813,0.594300,0.333107,0.168315,0.521703,0.294195,0.081644
3,0.515202,0.454023,0.212910,0.705052,0.127146,0.451053,0.936771,0.041946,0.828328,0.073110,...,0.173041,0.302766,0.088114,0.564927,0.399013,0.275409,0.050523,0.640452,0.027468,0.420035
4,0.348768,0.055929,0.415925,0.083880,0.800099,0.582615,0.995378,0.961846,0.660486,0.884122,...,0.896517,0.818581,0.358311,0.135070,0.331002,0.663722,0.527453,0.693052,0.482835,0.849277

In [144]:
newdf

            0         1         2         3         4
0    0.661356  0.790988  0.816955  0.515202  0.348768
1    0.369261  0.344447  0.594809  0.454023  0.055929
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
4    0.464154  0.677997  0.172498  0.127146  0.800099
..        ...       ...       ...       ...       ...
329  0.671657  0.081046  0.333107  0.275409  0.663722
330  0.675012  0.924776  0.168315  0.050523  0.527453
331  0.512223  0.837488  0.521703  0.640452  0.693052
332  0.818010  0.740888  0.294195  0.027468  0.482835
333  0.341005  0.670629  0.081644  0.420035  0.849277

[334 rows x 5 columns]

In [145]:
newdf.sort_index(axis=0, ascending=False)  # it sort index in reverse , 
                                            # here axis=0 (rows) and axis=1 (columns)

            0         1         2         3         4
333  0.341005  0.670629  0.081644  0.420035  0.849277
332  0.818010  0.740888  0.294195  0.027468  0.482835
331  0.512223  0.837488  0.521703  0.640452  0.693052
330  0.675012  0.924776  0.168315  0.050523  0.527453
329  0.671657  0.081046  0.333107  0.275409  0.663722
..        ...       ...       ...       ...       ...
4    0.464154  0.677997  0.172498  0.127146  0.800099
3    0.032329  0.200028  0.146421  0.705052  0.083880
2    0.173050  0.759926  0.340533  0.212910  0.415925
1    0.369261  0.344447  0.594809  0.454023  0.055929
0    0.661356  0.790988  0.816955  0.515202  0.348768

[334 rows x 5 columns]

In [146]:
df2 = newdf.copy()  # it copy dataframe to other

In [147]:
df2

            0         1         2         3         4
0    0.661356  0.790988  0.816955  0.515202  0.348768
1    0.369261  0.344447  0.594809  0.454023  0.055929
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
4    0.464154  0.677997  0.172498  0.127146  0.800099
..        ...       ...       ...       ...       ...
329  0.671657  0.081046  0.333107  0.275409  0.663722
330  0.675012  0.924776  0.168315  0.050523  0.527453
331  0.512223  0.837488  0.521703  0.640452  0.693052
332  0.818010  0.740888  0.294195  0.027468  0.482835
333  0.341005  0.670629  0.081644  0.420035  0.849277

[334 rows x 5 columns]

In [148]:
df2[0][0] = 97835  # it change value

In [149]:
df2

                0         1         2         3         4
0    97835.000000  0.790988  0.816955  0.515202  0.348768
1        0.369261  0.344447  0.594809  0.454023  0.055929
2        0.173050  0.759926  0.340533  0.212910  0.415925
3        0.032329  0.200028  0.146421  0.705052  0.083880
4        0.464154  0.677997  0.172498  0.127146  0.800099
..            ...       ...       ...       ...       ...
329      0.671657  0.081046  0.333107  0.275409  0.663722
330      0.675012  0.924776  0.168315  0.050523  0.527453
331      0.512223  0.837488  0.521703  0.640452  0.693052
332      0.818010  0.740888  0.294195  0.027468  0.482835
333      0.341005  0.670629  0.081644  0.420035  0.849277

[334 rows x 5 columns]

In [150]:
df2.columns = list("ABCDE")  # it change column index name

In [151]:
df2

                A         B         C         D         E
0    97835.000000  0.790988  0.816955  0.515202  0.348768
1        0.369261  0.344447  0.594809  0.454023  0.055929
2        0.173050  0.759926  0.340533  0.212910  0.415925
3        0.032329  0.200028  0.146421  0.705052  0.083880
4        0.464154  0.677997  0.172498  0.127146  0.800099
..            ...       ...       ...       ...       ...
329      0.671657  0.081046  0.333107  0.275409  0.663722
330      0.675012  0.924776  0.168315  0.050523  0.527453
331      0.512223  0.837488  0.521703  0.640452  0.693052
332      0.818010  0.740888  0.294195  0.027468  0.482835
333      0.341005  0.670629  0.081644  0.420035  0.849277

[334 rows x 5 columns]

# 7. Slicing of DataFrame

## loc -> it read index through the name given to it. ex> [0,'A'] , here row_name = 0 , column_name = A
## iloc -> it read index through the index_number.  ex> [3,4] , here row_index = 3 , column_index = 4 , no matter what is the name of columns and rows

# 8. loc function

In [152]:
df2.loc[0,0] = 654
df2.loc[0,'A'] = 654789  
df2.head()

               A         B         C         D         E      0
0  654789.000000  0.790988  0.816955  0.515202  0.348768  654.0
1       0.369261  0.344447  0.594809  0.454023  0.055929    NaN
2       0.173050  0.759926  0.340533  0.212910  0.415925    NaN
3       0.032329  0.200028  0.146421  0.705052  0.083880    NaN
4       0.464154  0.677997  0.172498  0.127146  0.800099    NaN

## To change all value of a column

In [153]:
df2[0] = None
df2

                 A         B         C         D         E     0
0    654789.000000  0.790988  0.816955  0.515202  0.348768  None
1         0.369261  0.344447  0.594809  0.454023  0.055929  None
2         0.173050  0.759926  0.340533  0.212910  0.415925  None
3         0.032329  0.200028  0.146421  0.705052  0.083880  None
4         0.464154  0.677997  0.172498  0.127146  0.800099  None
..             ...       ...       ...       ...       ...   ...
329       0.671657  0.081046  0.333107  0.275409  0.663722  None
330       0.675012  0.924776  0.168315  0.050523  0.527453  None
331       0.512223  0.837488  0.521703  0.640452  0.693052  None
332       0.818010  0.740888  0.294195  0.027468  0.482835  None
333       0.341005  0.670629  0.081644  0.420035  0.849277  None

[334 rows x 6 columns]

In [154]:
df2 = df2.drop(0 , axis=1) # To delete a column in a dataframe , for rows put axis = 0
df2

                 A         B         C         D         E
0    654789.000000  0.790988  0.816955  0.515202  0.348768
1         0.369261  0.344447  0.594809  0.454023  0.055929
2         0.173050  0.759926  0.340533  0.212910  0.415925
3         0.032329  0.200028  0.146421  0.705052  0.083880
4         0.464154  0.677997  0.172498  0.127146  0.800099
..             ...       ...       ...       ...       ...
329       0.671657  0.081046  0.333107  0.275409  0.663722
330       0.675012  0.924776  0.168315  0.050523  0.527453
331       0.512223  0.837488  0.521703  0.640452  0.693052
332       0.818010  0.740888  0.294195  0.027468  0.482835
333       0.341005  0.670629  0.081644  0.420035  0.849277

[334 rows x 5 columns]

In [155]:
# to delete selective rows
df2 = df2[~(df2.A > 1)]
df2

            A         B         C         D         E
1    0.369261  0.344447  0.594809  0.454023  0.055929
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
4    0.464154  0.677997  0.172498  0.127146  0.800099
5    0.431176  0.419692  0.052647  0.451053  0.582615
..        ...       ...       ...       ...       ...
329  0.671657  0.081046  0.333107  0.275409  0.663722
330  0.675012  0.924776  0.168315  0.050523  0.527453
331  0.512223  0.837488  0.521703  0.640452  0.693052
332  0.818010  0.740888  0.294195  0.027468  0.482835
333  0.341005  0.670629  0.081644  0.420035  0.849277

[333 rows x 5 columns]

In [156]:
df2.loc[[1,2],:]

          A         B         C         D         E
1  0.369261  0.344447  0.594809  0.454023  0.055929
2  0.173050  0.759926  0.340533  0.212910  0.415925

In [157]:
df2.loc[(df2['A']<0.3) & (df2['C']>0.1)]  # it gives all values satisfied given condition

            A         B         C         D         E
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
7    0.202698  0.114420  0.227797  0.041946  0.961846
20   0.017576  0.776549  0.794251  0.469509  0.255454
24   0.178367  0.014322  0.714689  0.836251  0.688511
..        ...       ...       ...       ...       ...
302  0.071848  0.212847  0.896676  0.303203  0.806676
304  0.216683  0.873060  0.736681  0.020481  0.672616
305  0.275824  0.099638  0.583479  0.493263  0.467765
322  0.073963  0.922812  0.391307  0.945057  0.661233
323  0.106551  0.598067  0.226470  0.845121  0.310030

[100 rows x 5 columns]

In [158]:
df2.head(3)

          A         B         C         D         E
1  0.369261  0.344447  0.594809  0.454023  0.055929
2  0.173050  0.759926  0.340533  0.212910  0.415925
3  0.032329  0.200028  0.146421  0.705052  0.083880

# 9. iloc function

In [159]:
df2.iloc[0,4]

0.055929091071674764

In [160]:
df2.iloc[[0,5] , [1,2]]

          B         C
1  0.344447  0.594809
6  0.149652  0.230062

In [161]:
df2.drop([10])

            A         B         C         D         E
1    0.369261  0.344447  0.594809  0.454023  0.055929
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
4    0.464154  0.677997  0.172498  0.127146  0.800099
5    0.431176  0.419692  0.052647  0.451053  0.582615
..        ...       ...       ...       ...       ...
329  0.671657  0.081046  0.333107  0.275409  0.663722
330  0.675012  0.924776  0.168315  0.050523  0.527453
331  0.512223  0.837488  0.521703  0.640452  0.693052
332  0.818010  0.740888  0.294195  0.027468  0.482835
333  0.341005  0.670629  0.081644  0.420035  0.849277

[332 rows x 5 columns]

In [162]:
df2.drop([1,5], axis=0, inplace = True) # it make changes in real df2 dataframe

C:\Python3.9\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [163]:
df2

            A         B         C         D         E
2    0.173050  0.759926  0.340533  0.212910  0.415925
3    0.032329  0.200028  0.146421  0.705052  0.083880
4    0.464154  0.677997  0.172498  0.127146  0.800099
6    0.305906  0.149652  0.230062  0.936771  0.995378
7    0.202698  0.114420  0.227797  0.041946  0.961846
..        ...       ...       ...       ...       ...
329  0.671657  0.081046  0.333107  0.275409  0.663722
330  0.675012  0.924776  0.168315  0.050523  0.527453
331  0.512223  0.837488  0.521703  0.640452  0.693052
332  0.818010  0.740888  0.294195  0.027468  0.482835
333  0.341005  0.670629  0.081644  0.420035  0.849277

[331 rows x 5 columns]

# 10. To Resest Dataframe Index

In [164]:
df2.reset_index(drop=True , inplace=True)  # it reset index no.
df2

            A         B         C         D         E
0    0.173050  0.759926  0.340533  0.212910  0.415925
1    0.032329  0.200028  0.146421  0.705052  0.083880
2    0.464154  0.677997  0.172498  0.127146  0.800099
3    0.305906  0.149652  0.230062  0.936771  0.995378
4    0.202698  0.114420  0.227797  0.041946  0.961846
..        ...       ...       ...       ...       ...
326  0.671657  0.081046  0.333107  0.275409  0.663722
327  0.675012  0.924776  0.168315  0.050523  0.527453
328  0.512223  0.837488  0.521703  0.640452  0.693052
329  0.818010  0.740888  0.294195  0.027468  0.482835
330  0.341005  0.670629  0.081644  0.420035  0.849277

[331 rows x 5 columns]

# 11. opertion of Null spaces in DataFrame

In [165]:
harry.head(6)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38,23,54,30.03,10,8.0,0.0,5,NaN,281
1,2016-01-02,36,18,46,30.02,10,7.0,0.0,3,NaN,275
2,2016-01-03,40,21,47,29.86,10,8.0,0.0,1,NaN,277
3,2016-01-04,25,9,44,30.05,10,9.0,0.0,3,NaN,345
4,2016-01-05,20,-3,41,30.57,10,5.0,0.0,0,NaN,333
5,2016-01-06,33,4,35,30.50,10,4.0,0.0,0,NaN,259

In [166]:
harry['WindSpeedMPH'].isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
Name: WindSpeedMPH, dtype: bool

In [167]:
# harry = harry.fillna(0)  # it fill all null places with 0 , but not very usefull for all the columns
# harry

In [168]:
harry = harry.fillna({
        'Temperature': 0,
        'WindSpeedMPH': 0,
        'Events': 'no event'
        })
harry.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38,23,54,30.03,10,8.0,0.0,5,no event,281
1,2016-01-02,36,18,46,30.02,10,7.0,0.0,3,no event,275
2,2016-01-03,40,21,47,29.86,10,8.0,0.0,1,no event,277
3,2016-01-04,25,9,44,30.05,10,9.0,0.0,3,no event,345
4,2016-01-05,20,-3,41,30.57,10,5.0,0.0,0,no event,333
5,2016-01-06,33,4,35,30.50,10,4.0,0.0,0,no event,259
6,2016-01-07,39,11,33,30.28,10,2.0,0.0,3,no event,293
7,2016-01-08,39,29,64,30.20,10,4.0,0.0,8,no event,79
8,2016-01-09,44,38,77,30.16,9,8.0,NaN,8,Rain,76
9,2016-01-10,50,46,71,29.59,4,0.0,1.8,7,Rain,109

In [169]:
# harry = harry.fillna(method="ffill" ,limit=1) # it takes value from backward cell
# harry = harry.fillna(method="bfill" ,limit=1) # it takes value from forward cell

In [170]:
harry = harry.replace([0 , 0.1], np.NaN)  # it replace the given value 
harry.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38.0,23.0,54.0,30.03,10.0,8.0,NaN,5.0,no event,281.0
1,2016-01-02,36.0,18.0,46.0,30.02,10.0,7.0,NaN,3.0,no event,275.0
2,2016-01-03,40.0,21.0,47.0,29.86,10.0,8.0,NaN,1.0,no event,277.0
3,2016-01-04,25.0,9.0,44.0,30.05,10.0,9.0,NaN,3.0,no event,345.0
4,2016-01-05,20.0,-3.0,41.0,30.57,10.0,5.0,NaN,NaN,no event,333.0
5,2016-01-06,33.0,4.0,35.0,30.50,10.0,4.0,NaN,NaN,no event,259.0
6,2016-01-07,39.0,11.0,33.0,30.28,10.0,2.0,NaN,3.0,no event,293.0
7,2016-01-08,39.0,29.0,64.0,30.20,10.0,4.0,NaN,8.0,no event,79.0
8,2016-01-09,44.0,38.0,77.0,30.16,9.0,8.0,NaN,8.0,Rain,76.0
9,2016-01-10,50.0,46.0,71.0,29.59,4.0,NaN,1.8,7.0,Rain,109.0

In [171]:
wind_mean = harry['WindSpeedMPH'].mean()

In [172]:
harry = harry.fillna({'WindSpeedMPH': wind_mean})
harry

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38.0,23.0,54.0,30.03,10.0,8.000000,NaN,5.0,no event,281.0
1,2016-01-02,36.0,18.0,46.0,30.02,10.0,7.000000,NaN,3.0,no event,275.0
2,2016-01-03,40.0,21.0,47.0,29.86,10.0,8.000000,NaN,1.0,no event,277.0
3,2016-01-04,25.0,9.0,44.0,30.05,10.0,9.000000,NaN,3.0,no event,345.0
4,2016-01-05,20.0,-3.0,41.0,30.57,10.0,5.000000,NaN,NaN,no event,333.0
5,2016-01-06,33.0,4.0,35.0,30.50,10.0,4.000000,NaN,NaN,no event,259.0
6,2016-01-07,39.0,11.0,33.0,30.28,10.0,2.000000,NaN,3.0,no event,293.0
7,2016-01-08,39.0,29.0,64.0,30.20,10.0,4.000000,NaN,8.0,no event,79.0
8,2016-01-09,44.0,38.0,77.0,30.16,9.0,8.000000,NaN,8.0,Rain,76.0
9,2016-01-10,50.0,46.0,71.0,29.59,4.0,6.892857,1.80,7.0,Rain,109.0
10,2016-01-11,33.0,8.0,37.0,29.92,10.0,6.892857,NaN,1.0,no event,289.0
11,2016-01-12,35.0,15.0,53.0,29.85,10.0,6.000000,NaN,4.0,no event,235.0
12,2016-01-13,26.0,4.0,42.0,29.94,10.0,10.000000,NaN,NaN,no event,284.0
13,2016-01-14,30.0,12.0,47.0,29.95,10.0,5.000000,NaN,7.0,no event,266.0
14,2016-01-15,43.0,31.0,62.0,29.82,9.0,5.000000,NaN,2.0,no event,101.0
15,2016-01-16,47.0,37.0,70.0,29.52,8.0,7.000000,0.24,7.0,Rain,340.0
16,2016-01-17,36.0,23.0,66.0,29.78,8.0,6.000000,0.05,6.0,Fog-Snow,345.0
17,2016-01-18,25.0,6.0,53.0,29.83,9.0,12.000000,NaN,2.0,Snow,293.0
18,2016-01-19,22.0,3.0,42.0,30.03,10.0,11.000000,NaN,1.0,no event,293.0
19,2016-01-20,32.0,15.0,49.0,30.13,10.0,6.000000,NaN,2.0,no event,302.0
20,2016-01-21,31.0,11.0,45.0,30.15,10.0,6.000000,NaN,1.0,no event,312.0
21,2016-01-22,26.0,6.0,41.0,30.21,9.0,6.892857,0.01,3.0,Snow,34.0
22,2016-01-23,26.0,21.0,78.0,29.77,1.0,16.000000,2.31,8.0,Fog-Snow,42.0
23,2016-01-24,28.0,11.0,53.0,29.92,8.0,6.000000,NaN,3.0,Snow,327.0
24,2016-01-25,34.0,18.0,54.0,30.25,10.0,3.000000,NaN,2.0,no event,286.0
25,2016-01-26,43.0,29.0,56.0,30.03,10.0,7.000000,NaN,2.0,no event,244.0
26,2016-01-27,41.0,22.0,45.0,30.03,10.0,7.000000,NaN,3.0,Rain,311.0
27,2016-01-28,37.0,20.0,51.0,29.90,10.0,5.000000,NaN,1.0,no event,234.0
28,2016-01-29,36.0,21.0,50.0,29.58,10.0,8.000000,NaN,4.0,no event,298.0
29,2016-01-30,34.0,16.0,46.0,30.01,10.0,7.000000,NaN,NaN,no event,257.0
30,2016-01-31,46.0,28.0,52.0,29.90,10.0,5.000000,NaN,NaN,no event,241.0